const protocol = {
  "explain": "呗呀借条小程序为广州小密科技有限公司旗下产品。使用呗呀借条小程序，也就意味着您同意本服务协议及呗呀借条小程序对其不时所做的修订。",
  "rules": [
    {
      "index": 1,
      "title": "第一条: 使用前提",
      "content": [
        `1. 通过使用呗呀借条小程序所提供的信息，工具以及其他功能，借助任何呗呀借条小程序生成电子借条、记录借款信息(以.上统称“服务”) ，都表示您同意遵守本服务协议，无论您是一个非注册用户，或者您是一个注册用户。`,
        `2. 如果您想成为注册用户并使用呗呀借条小程序提供的服务，您必须阅读并接受本服务协议。只要您注册成为呗呀借条小程序的用户(无论是通过呗呀借条小程序还是通过其他第三方媒介，下同)就视为您接受了本服务协议。如果您接受本服务协议，则表示您有能力受其约束，或者, 如果您代表了一个公司或实体，您有权使该实体受其约束。`
      ]
    },
    {
      "index": 2,
      "title": `第二条: 行为准则`,
      "content": [
        `1. 一旦您接收了本服务协议项下的条款和条件，即表示您同意在使用服务时遵守以下规则: `,
        `1.1 不得从事任何非法活动，不发布违反国家相关法律法规及政策规定的内容; `,
        `1.2 不得上传任何恶意代码;`,
        `1.3 不得滥用呗呀借条小程序所提供的资源或者服务，该等滥用包括但不限于重复应用、谋取不当利益等行为;`,
        `1.4 不得转让或继受、售卖呗呀借条小程序的账号和密码，以谋取不当利益; `,
        `1.5 不得公开展示或使用服务共享不当内容或材料(例如，涉及裸体、兽行、色情、暴力画面或犯罪活动)以及不符合适用法律或法规要求的内容或材料(例如，侵犯知识产权的软件或图片、文字、代码等) ; `,
        `1.6 不得传播任何形式的游戏软件作品;`,
        `1.7 不得从事虚假或误导性活动(例如编造虚假理由索要现金，假冒他人，操纵服务)或者中伤或诽谤活动; `,
        `1.8 不得规避服务的任何访问或可用性限制;`,
        `1.9 不得从事对您、服务或他人有害的活动(例如，传播病毒、跟踪、发布仇恨言论或宣扬针对他人的暴力行为); `,
        `1.10 不得利用呗呀借条小程序或其服务侵犯他人的合法权利; `,
        `1.11 不得从事侵犯他人隐私或数据保护权利的活动;`,
        `1.12 不得帮助他人违反，上述规则。`,
        `2. 强制执行。如果您违反本服务协议项下的条款和条件, 呗呀借条小程序有权在不提前通知您的情况下采取合理且适当的措施以维护呗呀借条小程序以及其他用户的合法及正当利益，该等措施包括但不限于停止为您提供服务、关闭您的呗呀借条小程序账户、删除您在呗呀借条小程序上发布的内容和信息，并保存相关记录及向有关政府主管部门举报。在对涉嫌违反本服务协议项下条款和条件的行为进行调查时，呗呀借条小程序将保留对您的内容进行审查以便解决问题的权利。`,
      ]
    },
    {
      "index": 3,
      "title": `第三条: 版权`,
      "content": [
        `呗呀借条小程序包含的所有内容，包括但不限于文本，图形，徽标，按钮图标，图像，音频剪辑，数码下载，数据编译，软件以及内容汇编都属于呗呀借条小程序所有，并受中国和国际版权法的保护。严禁未经呗呀借条小程序书面允许即对其上述内容进行复制、使用或者进行其他非法利用。`,
      ]
    },
    {
      "index": 4,
      "title": `第四条: 商标和服务标记`,
      "content": [
        `呗呀借条小程序,呗呀借条小程序标志和其他熟人借条小程序图形、标识、网页标题、按钮图标、脚本和服务名称均为呗呀借条小程序或其子公司及关联公司的商标、证明商标、服务标记或其它商业外观。呗呀借条小程序的. 商标、证明商标、服务标记和商业外观由于它们的限制使用而具有固有的意义和重大价值。它们不会被用于未经呗呀借条小程序许可的任何有关产品或服务。`,
      ]
    },
    {
      "index": 5,
      "title": `第五条: 访问许可`,
      "content": [
        `考虑到访问呗呀借条小程序和其服务，呗呀借条小程序将授予您一个访问呗呀借条小程序和用于个人使用的有限许可。本服务协议禁止您下载(页面缓存除外) 或修改呗呀借条小程序的任何部分，除非得到呗呀借条小程序明确的书面同意。本服务协议不允许转售呗呀借条小程序的服务。在未经呗呀借条小程序明确书面同意的情况下，您不得使用呗呀借条小程序上的任何商标、标识或其它专有的信息(包括但不限于图像、文本、网页布局或表单)。任何未经授权的使用自动终止了呗呀借条小程序授予的允许或许可，并可能产生各种损害赔偿的法律责任。`,
      ]
    },
    {
      "index": 6,
      "title": `第六条: 账户和密码`,
      "content": [
        `如果您同意成为呗呀借条小程序的用户并因此创建了一个账户，您需自行负责维护您的账户和密码的机密性，并且您同意接受对在您的账户或密码下发生的所有活动负责。呗呀借条小程序无义务且没有办法对非法或未经您授权使用您账号和密码的行为进行识别，因此，呗呀借条小程序对前述行为所引起的一切责任及其他不利后果不承担任何责任。但呗呀借条小程序保留以下权利:自行裁定权、拒绝服务、暂停或终止账户或以其他方式限制访问呗呀借条小程序和接受呗呀借条小程序的其他任何服务。`,
      ]
    },
    {
      "index": 7,
      "title": `第七条: 隐私及数据信息安全`,
      "content": [
        `1. 使用本服务，即表示您同意呗呀借条小程序合法收集和使用有关您及您所使用本服务的技术性或诊断性信息。收集到的些信息将用于改进网页的内容，提升我们的服务品质。呗呀借条小程序不会将您的信息和内容分享或出售给其他的组织。但以下情况除外:`,
        `1.1 您同意让第三方共享资料;`,
        `1.2 呗呀借条小程序需要听从法庭传票、法律命令或遵循法律程序;`,
        `1.3 您违反了本条款。`,
        `2. 呗呀借条小程序会竭力保护您的数据信息安全与隐私，但如发生包括但不限于以下任一状况，呗呀借条小程序将不承担任何法律责任:`,
        `2.1 因呗呀借条小程序无法对非法的或未经用户授权的使用呗呀借条小程序帐号及密码的行为作出甄别，因此造成您在呗呀借条小程序的帐号及密码被窃取的;`,
        `2.2 您发布的应用程序包括任何可链接到该应用程序的网址或其他在线服务侵犯到第三方知识产权的; `,
        `2.3 您通过呗呀借条小程序收集到的任何用户信息(包括但不限于用户设备信息等)，不仅只供内测使用，还提供给任何第三方或另作他用的;`,
        `2.4 因不可抗力，计算机病毒或黑客攻击，系统不稳定，您所在位置无网络信号，关机，GSM网络、互联网络、通信线路原因等造成的服务中断或不能满足您的服务要求、造成您的数据丢失的。`,
        ``,
      ]
    },
    {
      "index": 8,
      "title": `第八条: 服务或软件更新以及条款变更`,
      "content": [
        `1. 我们可能会随时变更本服务协议项下的条款和条件。如果您在该等条款和条件变更生效后使用服务，即表示您同意新的条款和条件。如果您不同意新的条款和条件，则必须停止访问呗呀借条小程序并停止使用其服务，并请关闭您的呗呀借条小程序帐户。`,
        `2. 有时，您可能需要软件更新，才能继续使用服务。我们会自动检查您的软件版本，并且下载软件更新或配置变更，包括那些可能会阻止您访问服务、或使用未经授权的硬件外围设备的配置变更，还可能要求您更新软件才能继续使用服务。此类更新受上述条款的约束，除非更新附带有其他条款，在这种情况下，其他条款应予适用。尽管有上述约定，呗呀借条小程序没有义务提供任何更新，也不保证呗呀借条小程序将针对您曾对软件进行许可的系统的版本提供支持。这种更新可能与由第三方提供的软件或服务不兼容。`,
        `3. 另外，有些时候，我们也许需要删除或更改服务的功能，或者停止提供一项服务，或者访问第三方应用程序和服务。除非适用的法律明确要求，否则我们无义务对已删除或更改之前的任何服务的功能或者服务提供重新下载或恢复。`,
      ]
    },
    {
      "index": 9,
      "title": `第九条: 保证`,
      "content": [
        `1. 呗呀借条小程序不提供与您使用服务相关的任何明示或默示的保证、保障或条件。您已了解，您应自行承担服务使用风险，我们按“现状”提供服务，服务可能存在各种缺陷，并且只提供服务的目前可用功能。呗呀借条小程序不保证服务中所提供的信息的准确性或时效性。根据适用法律，您可能享有某些权利，如果适用，本服务协议的条款中的任何规定均无意影响这些权利。您承认，计算机和电信系统可能会出现故障或偶尔会发生停机。我们不保证服务无中断、及时、安全、无错误、不发生内容丢失，也不会对与计算机网络的连接或传输作任何保证。`,
        `2. 在适用法律允许的范围内，我们排除有关适销性、质量满意度、特定用途的适用性、无工艺问题和不侵权的任何默示保证。`,
      ]
    },
    {
      "index": 10,
      "title": `第十条: 责任限制`,
      "content": [
        `1. 呗呀借条小程序仅对本协议中列明的责任承担范围负责。`,
        `2. 本协议约定服务之合作单位，所提供之服务品质及内容由该合作单位自行负责。`,
        `3. 在法律允许的情况下，呗呀借条小程序对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失(包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失)，不论是如何产生的，也不论是由对本协议的违约(包括违反保证)还是由侵权造成的，均不负有任何责任，即使事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除呗呀借条小程序对上述损失的责任。`,
        `4. 对于因超出呗呀借条小程序合理控制范围的情况(例如劳资纠纷、不可抗力、战争或恐怖主义行为、恶意破坏、意外事故或遵守任何适用法律或政府命令)而导致熟人借条小程序无法履行或延迟履行其义务，呗呀借条小程序对此不承担任何责任或义务。呗呀借条小程序将尽最大努力降低这些事件的影响，并将尽最大努力履行未受影响的义务。`,
      ]
    },
    {
      "index": 11,
      "title": `第十一条: 应用程序`,
      "content": [
        `1. 许可范围。呗呀借条小程序只授予您使用应用程序的某些权利。除非适用的法律赋予您此项限制之外的更多权利，否则您仅可在本协议明示许可的范围内使用应用程序。为此，您必须遵守应用程序中的任何技术限制，这些限制只允许您以特定的方式使用应用程序。您不得:`,
        `1.1 绕过应用程序中的任何技术限制。`,
        `1.2 对应用程序进行反向工程、反向编译或反汇编; 尽管有此项限制，但如果适用法律明示允许.上述活动，则在且仅在适用法律明示允许的范围内从事.上述活动不在此限。`,
        `1.3 制作超过本服务协议所规定或适用的法律所允许数量的应用程序副本。`,
        `1.4 发布或以其他方式提供应用程序以便其他人复制。`,
        `1.5 出租、租赁或出借应用程序。`,
        `1.6 将应用程序或本服务协议转让给任何第三方。`,
        `2.下载。应用程序的下载可能会消耗网络流量，因此而产生的费用，将由您自行承担。`,
        `3. 呗呀借条小程序会随时清理其上含有包括但不限于非法信息、色情内容、垃圾信息、等恶意信息。`,
        `4. 文档。如果随应用程序提供文档，则您可以复制和使用该文档，但仅供您个人参考之用。`,
      ]
    },
    {
      "index": 12,
      "title": `第十二条: 完整协议`,
      "content": [
        `本服务协议、任何适用的隐私政策、补充和更新条款以及您同意的任何隐私政策构成呗呀借条小程序服务及其应用程序的完整的服务协议。`
      ]
    },
    // 最后一个用来占位
    {
      "index": 13,
      "title": ` `,
      "content": [
        ` `,
        ` `,
        ` `,
        ` `,
        ` `,
        ` `,
        ` `,
        ` `,
        ` `,
        ` `,
      ]
    }
  ]
}

export {protocol}